Repository: lf-j/Open-Source-Guides-For-The-Enterprise
Catalog: BuildingLeadership_in_an_OpenSourceCommunity/tm/Building Leadership in an Open Source Community-EN.tmx
Source language: en_us
Languages: ja_jp

source: Building Leadership in an Open Source Community
ja_jp: オープンソース コミュニティでリーダーシップを構築する

source: Integrating into open source communities takes time and effort and requires a new approach to product development.
ja_jp: オープンソース コミュニティに溶け込むには時間と労力がかかり、製品開発への新しいアプローチの採用が必要となります。

source: Where traditional, proprietary development requires secrecy and a management hierarchy, open source development requires openness and values consensus.
ja_jp: 従来の、プロプライエタリな製品の開発が機密性と管理の階層を必要とする領域で、オープンソース開発は開示性を必要とし、意見の一致を重要視します。

source: Code contributions, not title or position, are what determine influence and technical direction in an open source project.
ja_jp: 役職や地位ではなく、コードの貢献こそが、オープンソース プロジェクト内での影響力と技術的方向性を決定付けるものです。

source: Open source projects are developed in diverse and geographically dispersed communities that have their own rules, conventions, tools, and processes.
ja_jp: オープンソース プロジェクトは、独自のルール、慣習、ツール、そしてプロセスを持つ、多様かつ地理的に分散されたコミュニティで開発されます。

source: Simply put, each community has its own unique culture and it takes time to establish the trust, ways of collaborating, and cultural understanding required to be effective in open source.
ja_jp: 端的に言うと、各コミュニティには独自の文化があり、オープンソースに影響力を発揮するために必要とされる信頼を確立し、協働の仕方を学び、文化を理解するには時間がかかるものです。

source: This guide explains how organizations can build leadership and influence within the open source projects they’re involved in and on which they are commercially dependent.
ja_jp: 本ガイドは、ある組織が関与し、商業的に依存しているオープンソース プロジェクト内でリーダーシップと影響力を構築するための方法を説明します。

source: Learn about leadership culture and roles within a project, how decisions are made, how an organization can build leadership, and tips for being a good leader in open source communities.
ja_jp: リーダーシップの文化とプロジェクト内での役割、決定がどのように下されるか、組織がリーダーシップを構築できるかを学び、そしてオープンソース コミュニティで良いリーダーになるためのヒントを得てください。

source: Contents
ja_jp: 目次

source: Why build leadership in an open source project?
ja_jp: オープンソース プロジェクトでリーダーシップを構築する理由

source: Leadership culture in open source
ja_jp: オープンソースでのリーダーシップ文化

source: How to become a leader
ja_jp: リーダーになる方法

source: Final Words
ja_jp: まとめ

source: View All Guides »
ja_jp: 全ガイドを表示 »

source: Contribute on GitHub »
ja_jp: GitHubへの貢献 »

source: Contributors to this Guide
ja_jp: 本ガイドの貢献者

source: Senior Director of Open Source
ja_jp: オープンソース担当シニアディレクター

source: at Oath (Yahoo + AOL)
ja_jp: Oath（Yahoo＋AOL）

source: Director, Open at Autodesk
ja_jp: ディレクター、Open@Autodesk

source: Section 1
ja_jp: セクション 1

source: Although the open source culture is collaborative, contributing upstream is only the first step in shaping an open source project’s progression.
ja_jp: オープンソース文化は協働的ではありますが、アップストリームの貢献はオープンソース プロジェクトを進展させる第一歩に過ぎません。

source: Taking an active role in guiding or influencing the project’s direction is also important if the project is critical to your company’s own products.
ja_jp: プロジェクトが御社の自社製品にとって必要不可欠な場合、プロジェクトの方向性を導き、影響を与える上での積極的な役割を担うことも、またとても重要です。

source: While open source projects have repeatedly proved the value of collaborations that even – and maybe especially – include competitors, having no say in a project’s direction can quickly prove to be a competitive disadvantage.
ja_jp: オープンソース プロジェクトが、競合他社さえも巻き込んだ協働の価値を繰り返し証明してきた中で、プロジェクトの方向性に関して発言権がないことは、競争上の優位性を失うことにつながることは自明です。

source: And this is why building and maintaining leadership in open source projects is key to corporate strategies and goals.
ja_jp: そして、これこそが、オープンソース プロジェクトでのリーダーシップを構築し維持することが企業の戦略と目標のカギとなる理由です。

source: However, it isn’t as easy as pounding desks and throwing around cash-based clout.
ja_jp: ただし、これは机をドンと叩いて主張したり、金銭的な影響力を振り回したりすればよいほど簡単なことではありません。

source: It is common for companies to first assume that leadership in an open source community works the same way as leadership does in a corporation.
ja_jp: 企業がオープンソース コミュニティでのリーダーシップの仕組みについて考えるとき、会社内でのリーダーシップと同じように働くと考えることは、よくあることでしょう。

source: It doesn’t.
ja_jp: しかし、それは違います。

source: “Companies often go through a phase of thinking ‘Oh, well, we’re huge.
ja_jp: 「企業はしばしば『そうは言っても、私たちは大きな影響力を持つ企業です。

source: Why can’t we pound our fist on the table and just make the community do what we want?’
ja_jp: 強く要望を伝えれば、コミュニティに私たちの希望に添ってもらうことができるのでは？』と考えてしまう段階を通ります。

source: They soon come to realize that tactic won’t work.
ja_jp: 彼らは程なく、その戦略が有効でないことに気付くでしょう。

source: They come to understand that the only way to gain leadership is to earn the role within the community.
ja_jp: リーダーシップを獲得する唯一の方法は、努力してコミュニティ内での役割を得ることだと理解し始めます。

source: And the only way to do that is to gain credibility and make contributions.”
ja_jp: そして、それを実現する唯一の方法は、信頼を獲得し、貢献することです」

source: Guy Martin — Director of Open at Autodesk
ja_jp: Guy Martin氏 — Autodesk社のオープンソース担当ディレクター

source: Why Should You Aim to Gain Leadership in Open Source?
ja_jp: 御社がオープンソースでのリーダーシップ獲得を目指すべき理由

source: Your products depend on open source software and technologies (and the communities creating them).
ja_jp: 御社の製品がオープンソース ソフトウェアと技術（そしてそれを作るコミュニティ）に依存しているため。

source: It offers you a faster path to innovation and the ability to focus on added value versus enablers.
ja_jp: リーダーシップが、御社にイノベーションへの近道と、成功要因に対しての付加価値に焦点を当てる能力を提供するため。

source: Open source rules the software ecosystem (or in other words, “Open Source is Eating the Software World”).
ja_jp: オープンソースがソフトウェアのエコシステムを規定しているため（別の言い方をすると「ソフトウェアの世界をオープンソースが侵食しているため」）。

source: Software is the new differentiator and where the core value is (vs. Hardware).
ja_jp: ソフトウェアこそが新しい差別化要因であり、（ハードウェアと比較して）これからの中心的な価値が存在する領域であるため。

source: It is re-defining every industry.
ja_jp: ソフトウェアはすべての産業を再定義しつつあります。

source: Corporate vs open source leadership
ja_jp: 企業VSオープンソース リーダーシップ

source: While gaining leadership in an open source project can be vital to a company’s own success in the commercial world, taking on such a radically new approach to product development is often counterintuitive and sometimes awkward in the beginning.
ja_jp: オープンソース プロジェクトでリーダーシップを獲得することが、商業の世界における企業自身の成功に欠かせないものである中で、そのように全く違った新しいアプローチを製品開発に取り入れることは、しばしば直感に反するものであり、始めは落ち着かないかもしれません。

source: Traditional, proprietary development requires secrecy and a management hierarchy.
ja_jp: 従来の、プロプライエタリな開発は機密性と管理階層を必要とします。

source: By contrast, titles and positions are meaningless in open source development, which instead puts a premium on openness and consensus.
ja_jp: それと比較するとオープンソース開発では、役職や地位は意味をもたず、開示性と意見の一致が重要視されます。

source: Code contributions are what determine influence and technical direction in an open source project.
ja_jp: コードの貢献こそが、オープンソース プロジェクト内での影響力と技術的方向性を決定付けるものです。

source: That means no fudging on code contributions; they must be substantial and truly advance the project in some way.
ja_jp: それはコードの貢献についてのごまかしが利かないことを意味し、実際的で、プロジェクトを何らかの方法で真に進展させるものでなくてはなりません。

source: At first, making upstream contributions and openly collaborating can feel like giving away the store.
ja_jp: 始めは、アップストリームに貢献し、協働することが自社の資産を放出しているように感じられるかもしれません。

source: But that feeling is not based in the open source reality; instead, it is a twinge of apprehension commonly associated with making a significant change in thinking and actions that is so very necessary to innovating.
ja_jp: しかしその感情は、オープンソースの現実に基づくものというより、一般的に考え方、行動を大きく変化させるときの不安感から来る痛みによるものであり、イノベーションを起こすためには特に必要なものです。

source: The open source leadership mindset involves thinking about:
ja_jp: オープンソース リーダーシップの考え方には、以下の項目に関して考えることが含まれます。

source: -Influence, not control
ja_jp: - 制御力ではなく、影響力

source: -Transparency as a means of crowd-sourcing solutions, not as exposure
ja_jp: - 露出としてではなく、クラウド ソーシング ソリューションの一つの方法としての透明性

source: -Leading, not herding
ja_jp: - 群れを統制することではなく、指揮すること

source: Successfully making the shift from a proprietary to an open source mindset and culture requires time and effort and sometimes a regular reminder of the benefits in doing so.
ja_jp: プロプライエタリからオープンソースの考え方と文化への移行を成功させるには、時間と努力、そしてときにそれを実行することの利益について定期的に思い出すことを必要とします。

source: Ibrahim Haddad, vice president of R&D and Head of Open Source at Samsung Electronics, built this chart for ease of reference.
ja_jp: Samsung Electronics社のR&D担当バイスプレジデント兼オープンソース グループ主席であるIbrahim Haddad氏は、参照しやすいように以下のチャートを作成しました。

source: The Need to Adapt to Collaborative Development
ja_jp: 共同開発に適応する必要性

source: Culture
ja_jp: 文化

source: Development Model
ja_jp: 開発モデル

source: Collaboration
ja_jp: 協働

source: Transparency
ja_jp: 透明性

source: Meritocracy
ja_jp: 実力主義

source: Processes
ja_jp: プロセス

source: Contribution
ja_jp: 貢献

source: Governance
ja_jp: ガバナンス

source: Approvals
ja_jp: 承認

source: Operational Model
ja_jp: 運用モデル

source: Compliance
ja_jp: コンプライアンス

source: Tools
ja_jp: ツール

source: IT Infrastructure
ja_jp: ITインフラ

source: Development Tools
ja_jp: 開発ツール

source: Knowledge Sharing
ja_jp: 知識の共有

source: Code Reuse
ja_jp: コードの再利用

source: HR
ja_jp: 人事

source: Team Formation
ja_jp: チームの形成

source: Organizational
ja_jp: 組織的

source: Hiring Practices
ja_jp: 雇用習慣

source: Metrics
ja_jp: 指標

source: Collaborative open source development requires gaining new skills and adapting your existing culture, processes, and tools.
ja_jp: 協働的なオープンソース開発は、新しいスキルの獲得と自社の持つ既存の文化、プロセス、ツールを適応させることを必要とします。

source: What Benefits Can You Expect From This Adoption?
ja_jp: この採用からはどのような利益が期待できますか？

source: -Sharing development costs with the global development community.
ja_jp: - グローバルな開発コミュニティと開発コストを共有すること。

source: -Lowering research and development costs.
ja_jp: - 研究開発のコストを削減すること。

source: -Increasing innovation by focusing on increased differentiation.
ja_jp: - さらなる差別化に焦点を当てることでイノベーションを促進すること。

source: -Accelerating product development.
ja_jp: - 製品開発の加速。

source: Governance overview
ja_jp: ガバナンスの概要

source: Governance guidelines in open source communities tend to be few but they are nonetheless rigidly enforced.
ja_jp: オープンソース コミュニティにおけるガバナンス ガイドラインは、項目が少ないことがほとんどですが、それでもなお、厳格に執行されています。

source: The code of conduct or community guidelines are unique to the community but generally address acceptable and expected behavior and the procedures for handling unacceptable behavior or other incidents.
ja_jp: 行動規範またはコミュニティ ガイドラインはそのコミュニティ固有のものですが、一般的に許容できる、および期待される行動、そして許容できない行動またはその他のインシデントの取り扱いについて言及します。

source: A governance policy details the management of the open source project’s policies, structures and roadmap.
ja_jp: ガバナンス ポリシーはオープンソース プロジェクトのポリシー、構造とロードマップの管理について詳細を規定します。

source: A maintenance policy typically addresses other project decisions such as software updates.
ja_jp: メンテナンス ポリシーは通常、ソフトウェア更新など、その他のプロジェクトに関する決定について規定します。

source: But governance at and surrounding the project and community level does not represent the entirety of governance policies and issues.
ja_jp: ただしプロジェクトとコミュニティのレベルにおける、そしてその周囲のガバナンスは、ガバナンスポリシーおよび問題の全体性を表しません。

source: Those also exist at the points where open source software is consumed, contributed to, redistributed and/or produced by commercial interests or other organizations.
ja_jp: また、オープンソース ソフトウェアが商業的な利益のため、またはその他の組織により消費される、貢献する、再配布および／または製造されるポイントにも、そのようなガバナンスが存在します。

source: Therefore, open source governance is by necessity part of the broader IT governance effort.
ja_jp: つまり、オープンソース ガバナンスは必然的に、より広範なITガバナンスの取り組みの一部であると言えます。

source: Companies tend to experience similar issues, such as multiple processes for how open source is consumed, inconsistent ways of contributing upstream in communities, and variances in how open source projects are created internally.
ja_jp: オープンソース消費方法にまつわる複数のプロセス、コミュニティへアップストリームの貢献をするための方法に一貫性がないこと、オープンソース プロジェクトが社内で作成される際の差異など、企業は同じような問題を経験する傾向にあります。

source: Developing a standardized set of governance is key to taming the chaos.
ja_jp: 標準化されたガバナンスを一式開発することが、混乱を鎮めるカギとなります。

source: “We aimed for one single process for contributing upstream and as an engineer I wanted it streamlined,” Martin said.
ja_jp: Martin氏はこう発言しています。「私たちはアップストリームの貢献について単一のプロセスを目指していました。エンジニアの一人として私は、それを効率化したいと望んでいました。

source: “I didn’t want a ten-week process with 500 pages of documentation for a five-line bug fix, so I worked with legal to streamline the workflow so an engineer could accomplish it in a reasonable amount of time.
ja_jp: 500ページにもわたる文書を用意し、たった5行のバグを修正する10週間のプロセスのような規模の作業にはしたくありませんでした。ですから、法務と協力してワークフローを効率化して、エンジニアが妥当な期間内に達成できるようにしました。

source: And then we did the same thing for creation of open source projects from code that’s in the company.”
ja_jp: そして私たちは、社内にあるコードからオープンソース プロジェクトを作成することについても同様に取り組みました」

source: It’s best for each company to work out the particulars in its own open source governance policies and processes so that it best fits how their company actually works; in effect mirroring how governance is best done at the community level.
ja_jp: それぞれの企業が、実際の取り組みに最も合うように自社のオープンソース ガバナンス ポリシーおよびプロセスの具体的な内容を検討することが最善です。これは実際にコミュニティレベルでガバナンスが最も効果的に発揮される方法とよく似ています。

source: But be aware that you may not be able to repeat a single process for all open source activities in your company.
ja_jp: ただし、御社内でのすべてのオープンソース活動で、同一のプロセスを繰り返すことができるわけではないことに注意してください。

source: A consistent governance plan prevents a huge version skew, as well as open source license and security issues.
ja_jp: 一貫性のあるガバナンス計画は大きなバージョン間の歪曲や、オープンソース ライセンスとセキュリティの問題についても防止します。

source: “A consistent governance model for open source consumption helps ensure compliance so that when we ship something, we know we’ve got the right license compliance in place.”
ja_jp: 「オープンソース消費についての一貫性のあるガバナンス モデルは、コンプライアンス保証に役立ち、私たちが何かを出荷するときには正しいライセンスへのコンプライアンスが実践されていると確信することができます」

source: OPEN SOURCE COMPLIANCE
ja_jp: オープンソース コンプライアンス

source: 6 Key Elements of Compliance Management
ja_jp: コンプライアンス管理の6つの重要要素

source: Identification of open source used in product repo.
ja_jp: 製品リポジトリ内で使用されているオープンソースの特定。

source: Auditing source code and resolving any found issues.
ja_jp: ソースコードの監査と、見つかった問題の解決。

source: Completing architecture analysis and legal reviews.
ja_jp: アーキテクチャ分析および法務的レビューの完了。

source: Updating software inventory; update product documentation to reflect proper open source notices.
ja_jp: ソフトウェア インベントリーの更新と、適切なオープンソース通知を反映するための製品文書の更新。

source: Performing verifications of all previous steps before product ships.
ja_jp: 製品出荷前の全手順検証の実践。

source: Making available source code (when applicable) as part of fulfilling open source license obligations.
ja_jp: オープンソース ライセンスの義務を果たす一環として、ソースコードを入手可能にすること（当てはまる場合）。

source: Culture overview
ja_jp: 文化の概要

source: While there is a pressing need to shift an organization’s internal culture to an open source state of mind, such must be accomplished without losing sight of, or disconnecting from, the open source community outside of the company walls.
ja_jp: ある組織の社内文化をオープンソースの考え方に変遷させる危急の必要がある中で、それは社外にあるオープンソース コミュニティを見失うこと、切り離されることなく実現されなくてはなりません。

source: “In order to develop influence on an open source project, you have to get a group of people whom you don’t know, who work for different companies, and may have different objectives to agree with you.”
ja_jp: 「オープンソース プロジェクト上での影響力を得るために、あなたは良く知らない、他の会社で働く、別の目的を持った人々の一団に、自分の意見に賛成してもらわなくてはなりません」

source: Gil Yehuda — Senior Director of Open Source at Oath (Yahoo+AOL)
ja_jp: Gil Yehuda氏 — Oath（Yahoo+AOL）のオープンソース担当シニアディレクター

source: That’s often easier said than done, since disputes and pushbacks are common and resolutions can take one of many directions depending on community consensus.
ja_jp: それはしばしば口で言うほど簡単なことではありません。争いや反対はよく起こり、解決策はコミュニティの意見の一致によっては多くの方向性のうち一つを必要とすることもあります。

source: “In an open source community, you have people who work for different companies who may have lots of areas of shared purpose and shared outcome and some areas of contention and cross purposes,” explains Yehuda.
ja_jp: Yahuda氏はこう解説しています。「オープンソース コミュニティには、さまざまな企業に勤める人が集っており、多くの領域では共通の目的や成果を持っていますが、一部の領域ではそれぞれの主張や相反する目的を持っているかもしれません」

source: For example, there may be one set of developers who want new functionality because they need it to make something work, but another group that doesn’t want that new functionality because they want stability.
ja_jp: たとえば、何かを動かすために必要な新機能を望む開発者の一団がいる場合、その新しい機能は安定性を望む他のグループには反対される可能性があります。

source: “Perhaps the new functionality compromises the stability or the scalability.
ja_jp: Yahuda氏はこう続けます。「新機能が安定性や拡張性を悪化させるかもしれません。

source: There’s going to be a fight or at least some tension over that,” explains Yehuda.
ja_jp: それについて紛争が起きるか、少なくとも緊張が走るでしょう」

source: Resolving the issue so that the project proceeds in one direction or the other is no small feat considering that no one person is in charge of making the decision.
ja_jp: 決定を下す責任を負う人がいるわけではないことを考慮すると、プロジェクトがいずれか一つの方向に前進するように問題を解決することは容易ではありません。

source: Instead, it’s a communal decision.
ja_jp: その代わり、それはコミュニティとしての決定になります。

source: “One of the things that can help the community arrive at what you would consider favorable resolution is if you have more influence in the project.
ja_jp: 「コミュニティが、あなたが望ましいと思う解決策に到達する助けになることの一つとして、プロジェクト内でのあなたの影響力を大きくすることがあります。

source: They’re going to support you even in a decision that might have small short term negative impact to them if you have leadership and you’re a trusted member of the community, and you have the community’s interest at heart.”
ja_jp: あなたにリーダーシップがあり、コミュニティで信頼を集めるメンバーとしてコミュニティの利益のことを想っていれば、彼らは短期的には小規模であれ彼らにとってマイナスの影響を及ぼす決定についても、あなたに賛成してくれるでしょう」

source: But building that leadership and maintaining it is as much a company mission as it is an individual developer’s goal.
ja_jp: そのリーダーシップを構築し維持することは、個別の開発者の目標であると同時に会社のミッションでもあります。

source: Oath’s approach is to instruct its developers to involve company assistance when they see situations that could potentially be contentious.
ja_jp: Oathのアプローチは、所属する開発者たちが潜在的に争いにつながりそうな状況に直面した際は、会社の支援を求めるよう指示することでした。

source: “We have active consulting, we have internal conversations about situations and how to best approach them, we have developers that share anecdotes with each other about situations and how they can resolve them,” says Yehuda.
ja_jp: Yahuda氏はこう発言しています。「私たちは活発な相談事業を実践し、状況と、それに対する最善のアプローチについて社内での話し合いを持ち、開発者がお互いに逸話と、解決策を共有するようにしています」

source: It’s also important to understand that leadership rests with the person, not the company.
ja_jp: また、リーダーシップは企業ではなくその個人と共にあることを理解することが重要です。

source: So even though the individual developer has the backing and assistance of his or her employer, that employer is at risk of losing influence if that developer chooses to leave.
ja_jp: 個別の開発者が、その雇用者からの援助と支援を受けられるのにもかかわらず、雇用者自身には、その開発者が退社することで影響力を失うリスクがあります。

source: “If you’ve got an open source project that is super critical to your product and you’ve only got one person from your company making upstream contributions, you have a single point of failure.
ja_jp: 「御社の製品にとってとても重要なオープンソース プロジェクトがあり、御社からアップストリームの貢献をしている人物が一人しかいない場合、御社は単一障害点を抱えていると同じです。

source: You have to a succession plan in place and it needs to include more than couple of people at your company”
ja_jp: 後継者育成計画を設定し、常時二人以上の人員を関わらせる必要があります」

source: That means multiple people in your company will be making upstream contributions.
ja_jp: それは、御社から複数の人員がアップストリームの貢献をしていくことを意味します。

source: A common first reaction to that idea is fear of tying up too many human resources on an open source project that other companies will benefit from.
ja_jp: そのようなアイディアに対するよくある反応として、他の会社もそこから利益を得られるオープンソース プロジェクトに多くの人材を拘束される、という恐れがあります。

source: But that’s not the case if you organize their time well.
ja_jp: しかし、それらの人員の時間をうまく調整すれば、そのようなことはありません。

source: “It’s more palatable to engineering management when less of Joe Smith’s time is used to make upstream contributions because that burden is shared with three or four other developers,” Says Martin.
ja_jp: Martin氏はこう発言しています。「3から4名の他の開発者とその負担が共有されているため、アップストリームの貢献をするために使われるある開発者の時間が減るということは、エンジニアリング管理に取ってより好ましい状態です。」

source: By balancing the workload, you also reduce the risk to the company in losing project influence when a key developer leaves.
ja_jp: 仕事の負荷のバランスを取ることで、主要な役割を担う開発者が退社して会社が影響力を失うリスクも減らすことができます。

source: This is also an attractive plan to developers who actively seek to increase their exposure in building leadership in the community as that ultimately boosts their careers and earning power.
ja_jp: 積極的にコミュニティ内でのリーダーシップ構築に参加しようとする開発者自身にとっても、結果的に自分のキャリアと収益力を高められるため、これは魅力的なプランです。

source: More developers get a lead role in this plan.
ja_jp: このプランでは、より多くの開発者が主席の役割を獲得できます。

source: Further, a company can adopt open source practices and principles internally through innersourcing, in order to complete the culture shift to open source, improve their innovation rate and successes, and further connect with the open source community which helps build leadership and attract developers.
ja_jp: さらに、企業は文化をオープンソースに移行し、イノベーションと成功の速度を向上して、オープンソース コミュニティとのつながりをさらに深めて、リーダーシップを構築し開発者にとっての魅力を増すため、インナー ソーシングを通じて社内でオープンソースの実践と理念を取り入れることができます。

source: Innersourcing
ja_jp: インナー ソーシング

source: Innersourcing is a term that references the application of the same principles and practices used in open source collaborative development in internal enterprise projects.
ja_jp: インナー ソーシングはオープンソースの共同開発で使用されている理念と実践と同じものを、社内の全社横断的プロジェクトで採用することを指す用語です。

source: 12 Recommended Best Practices
ja_jp: 12の推奨されるベストプラクティス

source: Improve testing methods, automate it, and make it an integral part of the development process.
ja_jp: 試験方法を改善、自動化し、開発プロセスのなくてはならない部分とする。

source: Enforce peer review and implement tools to automate the practice.
ja_jp: ピア レビューを実行し、実践を自動化するためのツールを実装する。

source: Make source code accessible to everyone in your organization.
ja_jp: 組織の全員がソースコードにアクセスできるようにする。

source: Adopt development tools with collaboration support built into it.
ja_jp: 協働サポートが組み込まれた開発ツールを採用する。

source: Adopt the “Release Early and Often” philosophy (shorter, more frequent releases).
ja_jp: 「早く、何度もリリースする」哲学を取り入れる（より短期間で、頻度の高いリリース）。

source: Invest time and effort into building scalable and modular architectures that allow code re-use.
ja_jp: コードの再利用ができる、拡張可能でモジュール式のアーキテクチャを構築するために時間と労力を投資する。

source: Adopt a continuous integration approach.
ja_jp: 継続的な統合アプローチを採用する。

source: Encourage fluid and open communication, and practice it.
ja_jp: 流動的でオープンなコミュニケーションを奨励し、実践する。

source: Improve documentation practices and use it as an additional means for quality assurance.
ja_jp: 文書化の実践を改善し、品質保証の追加の方策として使用する。

source: Make it possible for people to commit code even though they are not part of the project.
ja_jp: プロジェクトに参加していない人々でもコードをコミットできるようにする。

source: Increase transparency of decision making process (establish trust).
ja_jp: 意思決定プロセスの透明性を促進する（信頼を確立する）。

source: Empower individuals according to their contributions (meritocracy).
ja_jp: 貢献度合いにより個人に力を与える（実力主義）。

source: In short, culture is imperative in all its many nuances and on many levels, if the goal is to build and maintain leadership and thus some measure of control over critical projects.
ja_jp: まとめると、リーダーシップを構築、維持するという目標を掲げている場合、文化はたくさんの意味合いと多くのレベルで必要不可欠なものであり、故に重要プロジェクトではコントロール対策も欠かせません。

source: Through it all, remember to be mindful of the one percent rule.
ja_jp: すべてを通して、1パーセントルールにも気を付けましょう。

source: “90% are along for the ride and participate passively – this is the user community; 9% participate actively, submitting bugs, answering questions publicly – we call these ‘contributors’; 1% help to guide or control the project, assign bugs, determine direction – these are ‘maintainers’, or more simply, leaders,” explains Jeff Osier-Mixon, Intel/Yocto Project.
ja_jp: Intel/YoctoプロジェクトのJeff Osier-Mixon氏は、こう説明しています。「90%は流れに身を任せ消極的に参加します。これがユーザーコミュニティです。9%は積極的に参加し、バグを報告し、公に質問に回答します。私たちはこれらの人々を『貢献者』と呼びます。1%はプロジェクトを指揮またはコントロールする手助けをします。これらの人々は『保守者』あるいはもっと簡単に言うと『リーダー』です」

source: Each project is unique; adapt on a project by project basis.
ja_jp: それぞれのプロジェクトはユニークなものですので、プロジェクトごとに適応させましょう。

source: Leadership roles in a collaborative project
ja_jp: 共同プロジェクトにおけるリーダーシップの役割

source: While roles appear similar to corporate roles and structure, every project is different and structured and managed by a specific set of community guidelines and a governance policy.
ja_jp: 役割は企業での役割と構造に類似しているように見えますが、すべてのプロジェクトは異なり、特定のコミュニティ ガイドラインとガバナンス ポリシーによって構造化及び管理されています。
